{
  "AllowedHosts": "*",
  "Jwt": {
    "Issuer": "yamud.lagdaemon.com",
    "Key": "somekindofsecretkey",
    "Audience": "localhost"

  },
  "ConnectionStrings": {
    "postgres": "HAH_GET_YOUR_OWN",
    "MongoDB": "mongodb://localhost:27017",
    "DatabaseName": "YamudLogDB"
  },
  "SmtpSettings": {
    "Host": "SMTP_HOST",
    "Port": "SMTP_PORT",
    "Username": "SMTP_USERNAME",
    "Password": "SMTP_PASSWORD",
    "EnableSsl": "SMTP_ENABLE_SSL"
  },
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft": "Warning",
      "Microsoft.Hosting.Lifetime": "Information"
    }
  },
  "AppSettings": {
    "PluginsDirectory": "D:\\Projects\\YAMUD\\Plugins"
  },
  "ChatterBot": {
    "MinIntervalMinutes": 1,
    "MaxIntervalMinutes": 1,
    "Messages": [
      "Hello, everyone!",
      "How's everyone doing today?",
      "Any exciting news to share?",
      "What's your favorite thing to do in the game?",
      "Has anyone discovered any hidden secrets lately?",
      "Remember to stay hydrated and take breaks!",
      "Let's make today a great day!",
      "Did you know that exploration is key to success?",
      "Feel free to ask any questions you have!",
      "Who's up for a group adventure?",
      "Let's work together to overcome challenges!",
      "What's the best loot you've found so far?",
      "Let's keep the positive vibes going!",
      "Share your favorite gaming tips with the group!",
      "What's your favorite in-game activity?",
      "Anyone up for some friendly competition?",
      "Let's celebrate our victories together!",
      "Remember to help out fellow players when you can!",
      "Let's spread kindness and positivity!",
      "Share your most epic gaming moments with us!",
      "What are your goals for today's gaming session?",
      "Let's embark on an epic quest together!",
      "Did you know that teamwork makes the dream work?",
      "Who's ready for some epic battles?",
      "Let's create unforgettable memories in the game!",
      "What's the most challenging boss you've faced?",
      "Join us for some fun and excitement!",
      "Let's make new friends and explore together!",
      "Share your favorite gaming memories with us!",
      "Who's ready to level up their skills?",
      "Let's inspire each other to greatness!",
      "What's your favorite game strategy?",
      "Let's take on the world one quest at a time!",
      "What's the most creative character you've created?",
      "Who's up for a thrilling adventure?",
      "Let's aim for victory in every quest we undertake!",
      "Share your thoughts and ideas with the group!",
      "Who's ready to conquer the toughest challenges?",
      "Let's learn and grow together as a community!",
      "What's the best piece of advice you've received in the game?",
      "Join us for some epic battles and unforgettable experiences!",
      "Let's embark on a journey filled with excitement and wonder!",
      "Who's ready to explore uncharted territories?",
      "Let's support each other on our gaming journeys!",
      "What's your favorite thing about the game?",
      "Let's build friendships that last a lifetime!",
      "Who's excited to discover hidden treasures?",
      "Let's share our stories and adventures with one another!",
      "What's the most memorable quest you've completed?",
      "Join us for some epic quests and thrilling adventures!",
      "Let's make today a legendary day in the game!",
      "Who's ready to make new memories in the game world?",
      "Let's celebrate our victories and learn from our defeats!",
      "What's the most exciting thing you've encountered in the game?",
      "Join us for some fun and excitement in the game world!"
    ]

  }
}
